xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/03.controller_unit_sensor/system/libs/fwlib/py32l090_hal_rcc.h
#define RCC_HSICALIBRATION_DEFAULT       0x1100U                          /* Default HSI calibration trimming value */
/**
  * @}
  */
/** @defgroup RCC_HSI_Calibration HSI Calibration
* @{
*/
#define RCC_HSICALIBRATION_8MHz        ((0x1<<13) | ((*(uint32_t *)(0x1FFF1E04)) & 0x1FFF))  /*!< 8MHz HSI calibration trimming value */
#define RCC_HSICALIBRATION_16MHz       ((0x2<<13) | ((*(uint32_t *)(0x1FFF1E08)) & 0x1FFF))  /*!< 16MHz HSI calibration trimming value */
#define RCC_HSICALIBRATION_22p12MHz    ((0x3<<13) | ((*(uint32_t *)(0x1FFF1E0C)) & 0x1FFF))  /*!< 22.12MHz HSI calibration trimming value */
#define RCC_HSICALIBRATION_24MHz       ((0x4<<13) | ((*(uint32_t *)(0x1FFF1E10)) & 0x1FFF))  /*!< 24MHz HSI calibration trimming value */
#define RCC_HSICALIBRATION_48MHz       ((0x5<<13) | ((*(uint32_t *)(0x1FFF1E14)) & 0x1FFF))  /*!< 48MHz HSI calibration trimming value */
#define RCC_HSICALIBRATION_64MHz       ((0x6<<13) | ((*(uint32_t *)(0x1FFF1E18)) & 0x1FFF))  /*!< 64MHz HSI calibration trimming value */
/**
  * @}
  */
  
/** @defgroup RCC_HSI_Div HSI Div
  * @{
  */
#define RCC_HSI_DIV1                   0x00000000U                                        /*!< HSI clock is not divided */
#define RCC_HSI_DIV2                   RCC_CR_HSIDIV_0                                    /*!< HSI clock is divided by 2 */
#define RCC_HSI_DIV4                   RCC_CR_HSIDIV_1                                    /*!< HSI clock is divided by 4 */
#define RCC_HSI_DIV8                   (RCC_CR_HSIDIV_1|RCC_CR_HSIDIV_0)                  /*!< HSI clock is divided by 8 */
#define RCC_HSI_DIV16                  RCC_CR_HSIDIV_2                                    /*!< HSI clock is divided by 16 */
#define RCC_HSI_DIV32                  (RCC_CR_HSIDIV_2|RCC_CR_HSIDIV_0)                  /*!< HSI clock is divided by 32 */
#define RCC_HSI_DIV64                  (RCC_CR_HSIDIV_2|RCC_CR_HSIDIV_1)                  /*!< HSI clock is divided by 64 */
#define RCC_HSI_DIV128                 (RCC_CR_HSIDIV_2|RCC_CR_HSIDIV_1|RCC_CR_HSIDIV_0)  /*!< HSI clock is divided by 128 */
/**
  * @}
  */

/** @defgroup RCC_LSI_Config LSI Config
  * @{
  */
#define RCC_LSI_OFF                      0x00000000U              /*!< LSI clock deactivation */
#define RCC_LSI_ON                       RCC_BDCR_LSION            /*!< LSI clock activation */
/**
  * @}
  */

/** @defgroup RCC_MSI_Config MSI Config
  * @{
  */
#define RCC_MSI_OFF                      0x00000000U              /*!< MSI clock deactivation */
#define RCC_MSI_ON                       RCC_CR_MSION             /*!< MSI clock activation */
/**
  * @}
  */

/** @defgroup RCC_MSI_Div MSI Div
  * @{
  */
#define RCC_MSI_DIV1                   0x00000000U                                        /*!< MSI clock is not divided */
#define RCC_MSI_DIV2                   RCC_CR_MSIDIV_0                                    /*!< MSI clock is divided by 2 */
#define RCC_MSI_DIV4                   RCC_CR_MSIDIV_1                                    /*!< MSI clock is divided by 4 */
#define RCC_MSI_DIV8                   (RCC_CR_MSIDIV_1|RCC_CR_MSIDIV_0)                  /*!< MSI clock is divided by 8 */
#define RCC_MSI_DIV16                  RCC_CR_MSIDIV_2                                    /*!< MSI clock is divided by 16 */
#define RCC_MSI_DIV32                  (RCC_CR_MSIDIV_2|RCC_CR_MSIDIV_0)                  /*!< MSI clock is divided by 32 */
#define RCC_MSI_DIV64                  (RCC_CR_MSIDIV_2|RCC_CR_MSIDIV_1)                  /*!< MSI clock is divided by 64 */
#define RCC_MSI_DIV128                 (RCC_CR_MSIDIV_2|RCC_CR_MSIDIV_1|RCC_CR_MSIDIV_0)  /*!< MSI clock is divided by 128 */
/**
  * @}
  */

/** @defgroup RCC_PLL_Config PLL Config
  * @{
  */
#define RCC_PLL_NONE                      0x00000000U  /*!< PLL is not configured */
#define RCC_PLL_OFF                       0x00000001U  /*!< PLL deactivation */
#define RCC_PLL_ON                        0x00000002U  /*!< PLL activation */
/**
  * @}
  */

/** @defgroup RCC_System_Clock_Type System Clock Type
  * @{
  */
#define RCC_CLOCKTYPE_SYSCLK             0x00000001U /*!< SYSCLK to configure */
#define RCC_CLOCKTYPE_HCLK               0x00000002U /*!< HCLK to configure */
#define RCC_CLOCKTYPE_PCLK               0x00000004U /*!< PCLK to configure */
/**
  * @}
  */

/** @defgroup RCC_System_Clock_Source System Clock Source
  * @{
  */
#define RCC_SYSCLKSOURCE_HSISYS   RCC_CFGR_SW_HSISYS         /*!< HSISYS used as system clock */
#if defined(RCC_HSE_SUPPORT) 
#define RCC_SYSCLKSOURCE_HSE      RCC_CFGR_SW_HSE            /*!< HSE used as system clock */
#endif
#define RCC_SYSCLKSOURCE_PLLCLK   RCC_CFGR_SW_PLL            /*!< PLL used as system clock */
#define RCC_SYSCLKSOURCE_LSI      RCC_CFGR_SW_LSI            /*!< LSI used as system clock */
#if defined(RCC_LSE_SUPPORT)
#define RCC_SYSCLKSOURCE_LSE      RCC_CFGR_SW_LSE            /*!< LSE used as system clock */
#endif
#define RCC_SYSCLKSOURCE_MSISYS   RCC_CFGR_SW_MSISYS         /*!< MSISYS used as system clock */
/**
  * @}
  */

/** @defgroup RCC_System_Clock_Source_Status System Clock Source Status
  * @{
  */
#define RCC_SYSCLKSOURCE_STATUS_HSISYS   RCC_CFGR_SWS_HSISYS         /*!< HSISYS used as system clock */
#if defined(RCC_HSE_SUPPORT) 
#define RCC_SYSCLKSOURCE_STATUS_HSE      RCC_CFGR_SWS_HSE            /*!< HSE used as system clock */
#endif
#define RCC_SYSCLKSOURCE_STATUS_PLLCLK   RCC_CFGR_SWS_PLL            /*!< PLL used as system clock */
#define RCC_SYSCLKSOURCE_STATUS_LSI      RCC_CFGR_SWS_LSI            /*!< LSI used as system clock */
#if defined(RCC_LSE_SUPPORT)
#define RCC_SYSCLKSOURCE_STATUS_LSE      RCC_CFGR_SWS_LSE            /*!< LSE used as system clock */
#endif
#define RCC_SYSCLKSOURCE_STATUS_MSISYS   RCC_CFGR_SWS_MSISYS         /*!< MSISYS used as system clock */
/**
  * @}
  */

/** @defgroup RCC_AHB_Clock_Source AHB Clock Source
  * @{
  */
#define RCC_SYSCLK_DIV1                  0x00000000U   /*!< SYSCLK not divided */
#define RCC_SYSCLK_DIV2                  RCC_CFGR_HPRE_3   /*!< SYSCLK divided by 2 */
#define RCC_SYSCLK_DIV4                  (RCC_CFGR_HPRE_3 | RCC_CFGR_HPRE_0)   /*!< SYSCLK divided by 4 */
#define RCC_SYSCLK_DIV8                  (RCC_CFGR_HPRE_3 | RCC_CFGR_HPRE_1)   /*!< SYSCLK divided by 8 */
#define RCC_SYSCLK_DIV16                 (RCC_CFGR_HPRE_3 | RCC_CFGR_HPRE_1 | RCC_CFGR_HPRE_0)  /*!< SYSCLK divided by 16 */
#define RCC_SYSCLK_DIV64                 (RCC_CFGR_HPRE_3 | RCC_CFGR_HPRE_2)  /*!< SYSCLK divided by 64 */
#define RCC_SYSCLK_DIV128                (RCC_CFGR_HPRE_3 | RCC_CFGR_HPRE_2 | RCC_CFGR_HPRE_0) /*!< SYSCLK divided by 128 */
#define RCC_SYSCLK_DIV256                (RCC_CFGR_HPRE_3 | RCC_CFGR_HPRE_2 | RCC_CFGR_HPRE_1) /*!< SYSCLK divided by 256 */
#define RCC_SYSCLK_DIV512                (RCC_CFGR_HPRE_3 | RCC_CFGR_HPRE_2 | RCC_CFGR_HPRE_1   | RCC_CFGR_HPRE_0) /*!< SYSCLK divided by 512 */
/**
  * @}
  */

/** @defgroup RCC_APB_Clock_Source APB Clock Source
  * @{
  */
#define RCC_HCLK_DIV1                    0x00000000U                                           /*!< HCLK divided by 1 */
#define RCC_HCLK_DIV2                    RCC_CFGR_PPRE_2                                       /*!< HCLK divided by 2 */
#define RCC_HCLK_DIV4                    (RCC_CFGR_PPRE_2 | RCC_CFGR_PPRE_0)                   /*!< HCLK divided by 4 */
#define RCC_HCLK_DIV8                    (RCC_CFGR_PPRE_2 | RCC_CFGR_PPRE_1)                   /*!< HCLK divided by 8 */
#define RCC_HCLK_DIV16                   (RCC_CFGR_PPRE_2 | RCC_CFGR_PPRE_1 | RCC_CFGR_PPRE_0) /*!< HCLK divided by 16 */
/**
  * @}
  */

