xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/03.controller_unit_sensor/system/libs/fwlib/py32l090_hal_rcc.h
/** @defgroup RCC_RTC_Clock_Source RTC Clock Source
  * @{
  */
#define RCC_RTCCLKSOURCE_NONE            0x00000000U              /*!< No clock */
#if defined(RCC_LSE_SUPPORT)
#define RCC_RTCCLKSOURCE_LSE             RCC_BDCR_RTCSEL_0        /*!< LSE oscillator clock used as RTC clock */
#endif
#define RCC_RTCCLKSOURCE_LSI             RCC_BDCR_RTCSEL_1        /*!< LSI oscillator clock used as RTC clock */
#if defined(RCC_HSE_SUPPORT) 
#define RCC_RTCCLKSOURCE_HSE_DIV32       (RCC_BDCR_RTCSEL_1 | RCC_BDCR_RTCSEL_0)      /*!< HSE oscillator clock divided by 32 used as RTC clock */
#endif
/**
  * @}
  */

/** @defgroup RCC_IWDG_Clock_Source IWDG Clock Source
  * @{
  */
#define RCC_IWDGCLKSOURCE_LSI            0x00000000U              /*!< LSI oscillator clock used as IWDG clock */
#if defined(RCC_LSE_SUPPORT) 
#define RCC_IWDGCLKSOURCE_LSE            RCC_BDCR_IWDGSEL         /*!< LSE oscillator clock used as IWDG clock */
#endif
/**
  * @}
  */

/** @defgroup RCC_MCO_Index MCO Index
  * @{
  */
#define RCC_MCO1                         0x00000000U
#define RCC_MCO                          RCC_MCO1               /*!< MCO1 to be compliant with other families with 2 MCOs*/
#define RCC_MCO2                         0x00000001U
#define RCC_MCO3                         0x00000002U
#define RCC_MCO4                         0x00000003U
/**
  * @}
  */
  
/** @defgroup RCCEx_MCO1_Clock_Source MCO1 Clock Source
  * @{
  */
#define RCC_MCOSOURCE_NOCLOCK         0x00000000U                            /*!< MCO output disabled, no clock on MCO */
#define RCC_MCOSOURCE_SYSCLK          RCC_CFGR_MCOSEL_0                      /*!< SYSCLK selection as MCO source */
#define RCC_MCOSOURCE_HSI10M          RCC_CFGR_MCOSEL_1
#define RCC_MCOSOURCE_HSI             (RCC_CFGR_MCOSEL_1| RCC_CFGR_MCOSEL_0) /*!< HSI selection as MCO source */
#if defined(RCC_HSE_SUPPORT) 
#define RCC_MCOSOURCE_HSE             RCC_CFGR_MCOSEL_2                      /*!< HSE selection as MCO source */
#endif
#define RCC_MCOSOURCE_PLLCLK          (RCC_CFGR_MCOSEL_2|RCC_CFGR_MCOSEL_0)  /*!< PLLCLK selection as MCO source */
#define RCC_MCOSOURCE_LSI             (RCC_CFGR_MCOSEL_2|RCC_CFGR_MCOSEL_1)  /*!< LSI selection as MCO source */
#if defined(RCC_LSE_SUPPORT)
#define RCC_MCOSOURCE_LSE             (RCC_CFGR_MCOSEL_2|RCC_CFGR_MCOSEL_1|RCC_CFGR_MCOSEL_0) /*!< LSE selection as MCO source */
#endif
#define RCC_MCOSOURCE_HCLK            (RCC_CFGR_MCOSEL_3)
#define RCC_MCOSOURCE_PCLK            (RCC_CFGR_MCOSEL_3|RCC_CFGR_MCOSEL_0)
#define RCC_MCOSOURCE_MSI             (RCC_CFGR_MCOSEL_3|RCC_CFGR_MCOSEL_1)
#define RCC_MCOSOURCE_LCD_HSI10M      (RCC_CFGR_MCOSEL_3|RCC_CFGR_MCOSEL_1|RCC_CFGR_MCOSEL_0)
/**
  * @}
  */
  
/** @defgroup RCC_MCOx_Clock_Prescaler MCO1 Clock Prescaler
  * @{
  */
#define RCC_MCODIV_1                   (0x00000000U)                                                                     /*!< MCO not divided */
#define RCC_MCODIV_2                   (RCC_CFGR_MCOPRE_3)                                                               /*!< MCO divided by 2 */
#define RCC_MCODIV_4                   (RCC_CFGR_MCOPRE_3 | RCC_CFGR_MCOPRE_0)                                           /*!< MCO divided by 4 */
#define RCC_MCODIV_8                   (RCC_CFGR_MCOPRE_3 | RCC_CFGR_MCOPRE_1)                                           /*!< MCO divided by 8 */
#define RCC_MCODIV_16                  (RCC_CFGR_MCOPRE_3 | RCC_CFGR_MCOPRE_1 | RCC_CFGR_MCOPRE_0)                       /*!< MCO divided by 16 */
#define RCC_MCODIV_32                  (RCC_CFGR_MCOPRE_3 | RCC_CFGR_MCOPRE_2)                                           /*!< MCO divided by 32 */
#define RCC_MCODIV_64                  (RCC_CFGR_MCOPRE_3 | RCC_CFGR_MCOPRE_2 | RCC_CFGR_MCOPRE_0)                       /*!< MCO divided by 64 */
#define RCC_MCODIV_128                 (RCC_CFGR_MCOPRE_3 | RCC_CFGR_MCOPRE_2 | RCC_CFGR_MCOPRE_1)                       /*!< MCO divided by 128 */
#define RCC_MCODIV_256                 (RCC_CFGR_MCOPRE_3 | RCC_CFGR_MCOPRE_2 | RCC_CFGR_MCOPRE_1 | RCC_CFGR_MCOPRE_0)   /*!< MCO divided by 256 */
/**
  * @}
  */

/** @defgroup RCC_Interrupt Interrupts
  * @{
  */
#define RCC_IT_LSIRDY                    RCC_CIFR_LSIRDYF   /*!< LSI Ready Interrupt flag */
#if defined(RCC_LSE_SUPPORT)
#define RCC_IT_LSERDY                    RCC_CIFR_LSERDYF   /*!< LSE Ready Interrupt flag */
#define RCC_IT_LSECSS                    RCC_CIFR_LSECSSF   /*!< LSE Clock Security System Interrupt flag */
#endif
#define RCC_IT_MSIRDY                    RCC_CIFR_MSIRDYF   /*!< MSI Ready Interrupt flag */
#define RCC_IT_HSIRDY                    RCC_CIFR_HSIRDYF   /*!< HSI Ready Interrupt flag */
#if defined(RCC_HSE_SUPPORT) 
#define RCC_IT_HSERDY                    RCC_CIFR_HSERDYF   /*!< HSE Ready Interrupt flag */
#define RCC_IT_CSS                       RCC_CIFR_CSSF      /*!< Clock Security System Interrupt flag */
#endif
#define RCC_IT_PLLRDY                    RCC_CIFR_PLLRDYF   /*!< PLL Ready Interrupt flag */
/**
  * @}
  */

/** @defgroup RCC_Flag Flags
  *        Elements values convention: XXXYYYYYb
  *           - YYYYY  : Flag position in the register
  *           - XXX  : Register index
  *                 - 001: CR register
  *                 - 010: BDCR register
  *                 - 011: CSR register
  * @{
  */
/* Flags in the CR register */
#define RCC_FLAG_HSIRDY                  ((CR_REG_INDEX << 5U) | RCC_CR_HSIRDY_Pos) /*!< Internal High Speed clock ready flag */
#if defined(RCC_HSE_SUPPORT) 
#define RCC_FLAG_HSERDY                  ((CR_REG_INDEX << 5U) | RCC_CR_HSERDY_Pos) /*!< External High Speed clock ready flag */
#endif
#define RCC_FLAG_PLLRDY                  ((CR_REG_INDEX << 5U) | RCC_CR_PLLRDY_Pos) /*!< PLL clock ready flag */
#define RCC_FLAG_MSIRDY                  ((CR_REG_INDEX << 5U) | RCC_CR_MSIRDY_Pos) /*!< MSI clock ready flag */

/* Flags in the BDCR register */
#if defined(RCC_LSE_SUPPORT)
#define RCC_FLAG_LSERDY                  ((BDCR_REG_INDEX << 5U) | RCC_BDCR_LSERDY_Pos)  /*!< External Low Speed oscillator Ready */
#define RCC_FLAG_LSECSSD                 ((BDCR_REG_INDEX << 5U) | RCC_BDCR_LSECSSD_Pos) /*!< LSE Clock Security System Interrupt flag */
#endif
#define RCC_FLAG_LSIRDY                  ((BDCR_REG_INDEX << 5U) | RCC_BDCR_LSIRDY_Pos)  /*!< Internal Low Speed oscillator Ready */

