xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/03.controller_unit_sensor/system/libs/fwlib/py32l090_hal_rcc.h
#define __HAL_RCC_UART1_CLK_ENABLE()  do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APBENR1, RCC_APBENR1_UART1EN);\
                                        /* Delay after an RCC peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCC->APBENR1, RCC_APBENR1_UART1EN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)

#define __HAL_RCC_UART2_CLK_ENABLE()  do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APBENR1, RCC_APBENR1_UART2EN);\
                                        /* Delay after an RCC peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCC->APBENR1, RCC_APBENR1_UART2EN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)

#define __HAL_RCC_LPUART1_CLK_ENABLE() do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APBENR1, RCC_APBENR1_LPUART1EN);\
                                        /* Delay after an RCC peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCC->APBENR1, RCC_APBENR1_LPUART1EN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)

#define __HAL_RCC_I2C1_CLK_ENABLE()   do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APBENR1, RCC_APBENR1_I2C1EN);\
                                        /* Delay after an RCC peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCC->APBENR1, RCC_APBENR1_I2C1EN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)

#define __HAL_RCC_I2C2_CLK_ENABLE()   do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APBENR1, RCC_APBENR1_I2C2EN);\
                                        /* Delay after an RCC peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCC->APBENR1, RCC_APBENR1_I2C2EN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)

#define __HAL_RCC_OPA_CLK_ENABLE()    do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APBENR1, RCC_APBENR1_OPAEN);\
                                        /* Delay after an RCC peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCC->APBENR1, RCC_APBENR1_OPAEN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)
#if defined(FDCAN)
#define __HAL_RCC_CAN_CLK_ENABLE()    do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APBENR1, RCC_APBENR1_CANEN);\
                                        /* Delay after an RCC peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCC->APBENR1, RCC_APBENR1_CANEN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)
#endif
#define __HAL_RCC_DBG_CLK_ENABLE()    do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APBENR1, RCC_APBENR1_DBGEN);\
                                        /* Delay after an RCC peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCC->APBENR1, RCC_APBENR1_DBGEN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)

#define __HAL_RCC_PWR_CLK_ENABLE()    do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APBENR1, RCC_APBENR1_PWREN);\
                                        /* Delay after an RCC peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCC->APBENR1, RCC_APBENR1_PWREN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)

#define __HAL_RCC_DAC_CLK_ENABLE()    do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APBENR1, RCC_APBENR1_DACEN);\
                                        /* Delay after an RCC peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCC->APBENR1, RCC_APBENR1_DACEN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)

#define __HAL_RCC_LPTIM2_CLK_ENABLE() do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APBENR1, RCC_APBENR1_LPTIM2EN);\
                                        /* Delay after an RCC peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCC->APBENR1, RCC_APBENR1_LPTIM2EN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)

#define __HAL_RCC_LPTIM1_CLK_ENABLE() do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APBENR1, RCC_APBENR1_LPTIM1EN);\
                                        /* Delay after an RCC peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCC->APBENR1, RCC_APBENR1_LPTIM1EN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)

#define __HAL_RCC_TIM2_CLK_DISABLE()      (RCC->APBENR1 &= ~(RCC_APBENR1_TIM2EN))
#define __HAL_RCC_TIM3_CLK_DISABLE()      (RCC->APBENR1 &= ~(RCC_APBENR1_TIM3EN))
#define __HAL_RCC_TIM6_CLK_DISABLE()      (RCC->APBENR1 &= ~(RCC_APBENR1_TIM6EN))
#define __HAL_RCC_TIM7_CLK_DISABLE()      (RCC->APBENR1 &= ~(RCC_APBENR1_TIM7EN))
#define __HAL_RCC_PWM_CLK_DISABLE()       (RCC->APBENR1 &= ~(RCC_APBENR1_PWMEN))
#define __HAL_RCC_WWDG_CLK_DISABLE()      (RCC->APBENR1 &= ~(RCC_APBENR1_WWDGEN))
#define __HAL_RCC_SPI2_CLK_DISABLE()      (RCC->APBENR1 &= ~(RCC_APBENR1_SPI2EN))
#define __HAL_RCC_LPUART2_CLK_DISABLE()   (RCC->APBENR1 &= ~(RCC_APBENR1_LPUART2EN))
#define __HAL_RCC_USART2_CLK_DISABLE()    (RCC->APBENR1 &= ~(RCC_APBENR1_USART2EN))
#define __HAL_RCC_UART1_CLK_DISABLE()     (RCC->APBENR1 &= ~(RCC_APBENR1_UART1EN))
#define __HAL_RCC_UART2_CLK_DISABLE()     (RCC->APBENR1 &= ~(RCC_APBENR1_UART2EN))
#define __HAL_RCC_LPUART1_CLK_DISABLE()   (RCC->APBENR1 &= ~(RCC_APBENR1_LPUART1EN))
#define __HAL_RCC_I2C1_CLK_DISABLE()      (RCC->APBENR1 &= ~(RCC_APBENR1_I2C1EN))
#define __HAL_RCC_I2C2_CLK_DISABLE()      (RCC->APBENR1 &= ~(RCC_APBENR1_I2C2EN))
#define __HAL_RCC_OPA_CLK_DISABLE()       (RCC->APBENR1 &= ~(RCC_APBENR1_OPAEN))
#if defined(FDCAN)
#define __HAL_RCC_CAN_CLK_DISABLE()       (RCC->APBENR1 &= ~(RCC_APBENR1_CANEN))
#endif
#define __HAL_RCC_DBG_CLK_DISABLE()       (RCC->APBENR1 &= ~(RCC_APBENR1_DBGEN))
#define __HAL_RCC_PWR_CLK_DISABLE()       (RCC->APBENR1 &= ~(RCC_APBENR1_PWREN))
#define __HAL_RCC_DAC_CLK_DISABLE()       (RCC->APBENR1 &= ~(RCC_APBENR1_DACEN))
#define __HAL_RCC_LPTIM2_CLK_DISABLE()    (RCC->APBENR1 &= ~(RCC_APBENR1_LPTIM2EN))
#define __HAL_RCC_LPTIM1_CLK_DISABLE()    (RCC->APBENR1 &= ~(RCC_APBENR1_LPTIM1EN))
/**
  * @}
  */

