xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/03.controller_unit_sensor/system/libs/fwlib/py32l090_hal_rcc.h
/** @defgroup RCC_APB1_Peripheral_Clock_Enable_Disable_Status APB1 Peripheral Clock Enable Disable Status
  * @brief  Get the enable or disable status of the APB1 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */
#define __HAL_RCC_TIM2_IS_CLK_ENABLED()       ((RCC->APBENR1 & (RCC_APBENR1_TIM2EN)) != RESET)
#define __HAL_RCC_TIM2_IS_CLK_DISABLED()      ((RCC->APBENR1 & (RCC_APBENR1_TIM2EN)) == RESET)
#define __HAL_RCC_TIM3_IS_CLK_ENABLED()       ((RCC->APBENR1 & (RCC_APBENR1_TIM3EN)) != RESET)
#define __HAL_RCC_TIM3_IS_CLK_DISABLED()      ((RCC->APBENR1 & (RCC_APBENR1_TIM3EN)) == RESET)
#define __HAL_RCC_TIM6_IS_CLK_ENABLED()       ((RCC->APBENR1 & (RCC_APBENR1_TIM6EN)) != RESET)
#define __HAL_RCC_TIM6_IS_CLK_DISABLED()      ((RCC->APBENR1 & (RCC_APBENR1_TIM6EN)) == RESET)
#define __HAL_RCC_TIM7_IS_CLK_ENABLED()       ((RCC->APBENR1 & (RCC_APBENR1_TIM7EN)) != RESET)
#define __HAL_RCC_TIM7_IS_CLK_DISABLED()      ((RCC->APBENR1 & (RCC_APBENR1_TIM7EN)) == RESET)
#define __HAL_RCC_PWM_IS_CLK_ENABLED()        ((RCC->APBENR1 & (RCC_APBENR1_PWMEN)) != RESET)
#define __HAL_RCC_PWM_IS_CLK_DISABLED()       ((RCC->APBENR1 & (RCC_APBENR1_PWMEN)) == RESET)
#define __HAL_RCC_WWDG_IS_CLK_ENABLED()       ((RCC->APBENR1 & (RCC_APBENR1_WWDGEN)) != RESET)
#define __HAL_RCC_WWDG_IS_CLK_DISABLED()      ((RCC->APBENR1 & (RCC_APBENR1_WWDGEN)) == RESET)
#define __HAL_RCC_SPI2_IS_CLK_ENABLED()       ((RCC->APBENR1 & (RCC_APBENR1_SPI2EN)) != RESET)
#define __HAL_RCC_SPI2_IS_CLK_DISABLED()      ((RCC->APBENR1 & (RCC_APBENR1_SPI2EN)) == RESET)
#define __HAL_RCC_LPUART2_IS_CLK_ENABLED()    ((RCC->APBENR1 & (RCC_APBENR1_LPUART2EN)) != RESET)
#define __HAL_RCC_LPUART2_IS_CLK_DISABLED()   ((RCC->APBENR1 & (RCC_APBENR1_LPUART2EN)) == RESET)
#define __HAL_RCC_USART2_IS_CLK_ENABLED()     ((RCC->APBENR1 & (RCC_APBENR1_USART2EN)) != RESET)
#define __HAL_RCC_USART2_IS_CLK_DISABLED()    ((RCC->APBENR1 & (RCC_APBENR1_USART2EN)) == RESET)
#define __HAL_RCC_UART1_IS_CLK_ENABLED()      ((RCC->APBENR1 & (RCC_APBENR1_UART1EN)) != RESET)
#define __HAL_RCC_UART1_IS_CLK_DISABLED()     ((RCC->APBENR1 & (RCC_APBENR1_UART1EN)) == RESET)
#define __HAL_RCC_UART2_IS_CLK_ENABLED()      ((RCC->APBENR1 & (RCC_APBENR1_UART2EN)) != RESET)
#define __HAL_RCC_UART2_IS_CLK_DISABLED()     ((RCC->APBENR1 & (RCC_APBENR1_UART2EN)) == RESET)
#define __HAL_RCC_LPUART1_IS_CLK_ENABLED()    ((RCC->APBENR1 & (RCC_APBENR1_LPUART1EN)) != RESET)
#define __HAL_RCC_LPUART1_IS_CLK_DISABLED()   ((RCC->APBENR1 & (RCC_APBENR1_LPUART1EN)) == RESET)
#define __HAL_RCC_I2C1_IS_CLK_ENABLED()       ((RCC->APBENR1 & (RCC_APBENR1_I2C1EN)) != RESET)
#define __HAL_RCC_I2C1_IS_CLK_DISABLED()      ((RCC->APBENR1 & (RCC_APBENR1_I2C1EN)) == RESET)
#define __HAL_RCC_I2C2_IS_CLK_ENABLED()       ((RCC->APBENR1 & (RCC_APBENR1_I2C2EN)) != RESET)
#define __HAL_RCC_I2C2_IS_CLK_DISABLED()      ((RCC->APBENR1 & (RCC_APBENR1_I2C2EN)) == RESET)
#define __HAL_RCC_OPA_IS_CLK_ENABLED()        ((RCC->APBENR1 & (RCC_APBENR1_OPAEN)) != RESET)
#define __HAL_RCC_OPA_IS_CLK_DISABLED()       ((RCC->APBENR1 & (RCC_APBENR1_OPAEN)) == RESET)
#if defined(FDCAN)
#define __HAL_RCC_CAN_IS_CLK_ENABLED()        ((RCC->APBENR1 & (RCC_APBENR1_CANEN)) != RESET)
#define __HAL_RCC_CAN_IS_CLK_DISABLED()       ((RCC->APBENR1 & (RCC_APBENR1_CANEN)) == RESET)
#endif
#define __HAL_RCC_DBG_IS_CLK_ENABLED()        ((RCC->APBENR1 & (RCC_APBENR1_DBGEN)) != RESET)
#define __HAL_RCC_DBG_IS_CLK_DISABLED()       ((RCC->APBENR1 & (RCC_APBENR1_DBGEN)) == RESET)
#define __HAL_RCC_PWR_IS_CLK_ENABLED()        ((RCC->APBENR1 & (RCC_APBENR1_PWREN)) != RESET)
#define __HAL_RCC_PWR_IS_CLK_DISABLED()       ((RCC->APBENR1 & (RCC_APBENR1_PWREN)) == RESET)
#define __HAL_RCC_DAC_IS_CLK_ENABLED()        ((RCC->APBENR1 & (RCC_APBENR1_DACEN)) != RESET)
#define __HAL_RCC_DAC_IS_CLK_DISABLED()       ((RCC->APBENR1 & (RCC_APBENR1_DACEN)) == RESET)
#define __HAL_RCC_LPTIM2_IS_CLK_ENABLED()     ((RCC->APBENR1 & (RCC_APBENR1_LPTIM2EN)) != RESET)
#define __HAL_RCC_LPTIM2_IS_CLK_DISABLED()    ((RCC->APBENR1 & (RCC_APBENR1_LPTIM2EN)) == RESET)
#define __HAL_RCC_LPTIM1_IS_CLK_ENABLED()     ((RCC->APBENR1 & (RCC_APBENR1_LPTIM1EN)) != RESET)
#define __HAL_RCC_LPTIM1_IS_CLK_DISABLED()    ((RCC->APBENR1 & (RCC_APBENR1_LPTIM1EN)) == RESET)

/**
  * @}
  */

/** @defgroup RCC_APB2_Clock_Enable_Disable APB2 Clock Enable Disable
  * @brief  Enable or disable the High Speed APB (APB2) peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */
#define __HAL_RCC_SYSCFG_CLK_ENABLE()  do { \
                                         __IO uint32_t tmpreg; \
                                         SET_BIT(RCC->APBENR2, RCC_APBENR2_SYSCFGEN); \
                                         /* Delay after an RCC peripheral clock enabling */\
                                         tmpreg = READ_BIT(RCC->APBENR2, RCC_APBENR2_SYSCFGEN);\
                                         UNUSED(tmpreg); \
                                       } while(0U)

#define __HAL_RCC_TIM1_CLK_ENABLE()   do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APBENR2, RCC_APBENR2_TIM1EN);\
                                        /* Delay after an RCC peripheral clock enabling */\
                                        tmpreg = READ_BIT(RCC->APBENR2, RCC_APBENR2_TIM1EN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)

#define __HAL_RCC_SPI1_CLK_ENABLE()   do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APBENR2, RCC_APBENR2_SPI1EN);\
                                        /* Delay after an RCC peripheral clock enabling */\
                                        tmpreg = READ_BIT(RCC->APBENR2, RCC_APBENR2_SPI1EN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)

#define __HAL_RCC_USART1_CLK_ENABLE()  do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APBENR2, RCC_APBENR2_USART1EN);\
                                        /* Delay after an RCC peripheral clock enabling */\
                                        tmpreg = READ_BIT(RCC->APBENR2, RCC_APBENR2_USART1EN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)

#define __HAL_RCC_TIM15_CLK_ENABLE()  do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APBENR2, RCC_APBENR2_TIM15EN);\
                                        /* Delay after an RCC peripheral clock enabling */\
                                        tmpreg = READ_BIT(RCC->APBENR2, RCC_APBENR2_TIM15EN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)

#define __HAL_RCC_TIM16_CLK_ENABLE()  do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APBENR2, RCC_APBENR2_TIM16EN);\
                                        /* Delay after an RCC peripheral clock enabling */\
                                        tmpreg = READ_BIT(RCC->APBENR2, RCC_APBENR2_TIM16EN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)

#define __HAL_RCC_TIM17_CLK_ENABLE()  do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APBENR2, RCC_APBENR2_TIM17EN);\
                                        /* Delay after an RCC peripheral clock enabling */\
                                        tmpreg = READ_BIT(RCC->APBENR2, RCC_APBENR2_TIM17EN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)

#define __HAL_RCC_ADC_CLK_ENABLE()    do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APBENR2, RCC_APBENR2_ADCEN);\
                                        /* Delay after an RCC peripheral clock enabling */\
                                        tmpreg = READ_BIT(RCC->APBENR2, RCC_APBENR2_ADCEN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)

#define __HAL_RCC_COMP1_CLK_ENABLE()  do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APBENR2, RCC_APBENR2_COMP1EN);\
                                        /* Delay after an RCC peripheral clock enabling */\
                                        tmpreg = READ_BIT(RCC->APBENR2, RCC_APBENR2_COMP1EN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)

#define __HAL_RCC_COMP2_CLK_ENABLE()  do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APBENR2, RCC_APBENR2_COMP2EN);\
                                        /* Delay after an RCC peripheral clock enabling */\
                                        tmpreg = READ_BIT(RCC->APBENR2, RCC_APBENR2_COMP2EN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)

#define __HAL_RCC_LCD_CLK_ENABLE()    do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APBENR2, RCC_APBENR2_LCDEN);\
                                        /* Delay after an RCC peripheral clock enabling */\
                                        tmpreg = READ_BIT(RCC->APBENR2, RCC_APBENR2_LCDEN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)
#if defined(TK)
#define __HAL_RCC_TK_CLK_ENABLE()     do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APBENR2, RCC_APBENR2_TKEN);\
                                        /* Delay after an RCC peripheral clock enabling */\
                                        tmpreg = READ_BIT(RCC->APBENR2, RCC_APBENR2_TKEN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)
#endif

#if defined(VREFBUF)
#define __HAL_RCC_VREFBUF_CLK_ENABLE()  do { \
                                          __IO uint32_t tmpreg; \
                                          SET_BIT(RCC->APBENR2, RCC_APBENR2_VREFBUFEN);\
                                          /* Delay after an RCC peripheral clock enabling */\
                                          tmpreg = READ_BIT(RCC->APBENR2, RCC_APBENR2_VREFBUFEN);\
                                          UNUSED(tmpreg); \
                                        } while(0U)
#endif 

#define __HAL_RCC_SYSCFG_CLK_DISABLE()    (RCC->APBENR2 &= ~(RCC_APBENR2_SYSCFGEN))
#define __HAL_RCC_TIM1_CLK_DISABLE()      (RCC->APBENR2 &= ~(RCC_APBENR2_TIM1EN))
#define __HAL_RCC_SPI1_CLK_DISABLE()      (RCC->APBENR2 &= ~(RCC_APBENR2_SPI1EN))
#define __HAL_RCC_USART1_CLK_DISABLE()    (RCC->APBENR2 &= ~(RCC_APBENR2_USART1EN))
#define __HAL_RCC_TIM15_CLK_DISABLE()     (RCC->APBENR2 &= ~(RCC_APBENR2_TIM15EN))
#define __HAL_RCC_TIM16_CLK_DISABLE()     (RCC->APBENR2 &= ~(RCC_APBENR2_TIM16EN))
#define __HAL_RCC_TIM17_CLK_DISABLE()     (RCC->APBENR2 &= ~(RCC_APBENR2_TIM17EN))
#define __HAL_RCC_ADC_CLK_DISABLE()       (RCC->APBENR2 &= ~(RCC_APBENR2_ADCEN))
#define __HAL_RCC_COMP1_CLK_DISABLE()     (RCC->APBENR2 &= ~(RCC_APBENR2_COMP1EN))
#define __HAL_RCC_COMP2_CLK_DISABLE()     (RCC->APBENR2 &= ~(RCC_APBENR2_COMP2EN))
#define __HAL_RCC_LCD_CLK_DISABLE()       (RCC->APBENR2 &= ~(RCC_APBENR2_LCDEN))
#if defined(TK)
#define __HAL_RCC_TK_CLK_DISABLE()        (RCC->APBENR2 &= ~(RCC_APBENR2_TKEN))
#endif
#if defined(VREFBUF)
#define __HAL_RCC_VREFBUF_CLK_DISABLE()   (RCC->APBENR2 &= ~(RCC_APBENR2_VREFBUFEN))
#endif
/**
  * @}
  */

/** @defgroup RCC_APB2_Peripheral_Clock_Enable_Disable_Status APB2 Peripheral Clock Enable Disable Status
  * @brief  Get the enable or disable status of the APB2 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */
#define __HAL_RCC_SYSCFG_IS_CLK_ENABLED()     ((RCC->APBENR2 & (RCC_APBENR2_SYSCFGEN)) != RESET)
#define __HAL_RCC_SYSCFG_IS_CLK_DISABLED()    ((RCC->APBENR2 & (RCC_APBENR2_SYSCFGEN)) == RESET)
#define __HAL_RCC_TIM1_IS_CLK_ENABLED()       ((RCC->APBENR2 & (RCC_APBENR2_TIM1EN)) != RESET)
#define __HAL_RCC_TIM1_IS_CLK_DISABLED()      ((RCC->APBENR2 & (RCC_APBENR2_TIM1EN)) == RESET)
#define __HAL_RCC_SPI1_IS_CLK_ENABLED()       ((RCC->APBENR2 & (RCC_APBENR2_SPI1EN)) != RESET)
#define __HAL_RCC_SPI1_IS_CLK_DISABLED()      ((RCC->APBENR2 & (RCC_APBENR2_SPI1EN)) == RESET)
#define __HAL_RCC_USART1_IS_CLK_ENABLED()     ((RCC->APBENR2 & (RCC_APBENR2_USART1EN)) != RESET)
#define __HAL_RCC_USART1_IS_CLK_DISABLED()    ((RCC->APBENR2 & (RCC_APBENR2_USART1EN)) == RESET)
#define __HAL_RCC_TIM15_IS_CLK_ENABLED()      ((RCC->APBENR2 & (RCC_APBENR2_TIM15EN)) != RESET)
#define __HAL_RCC_TIM15_IS_CLK_DISABLED()     ((RCC->APBENR2 & (RCC_APBENR2_TIM15EN)) == RESET)
#define __HAL_RCC_TIM16_IS_CLK_ENABLED()      ((RCC->APBENR2 & (RCC_APBENR2_TIM16EN)) != RESET)
#define __HAL_RCC_TIM16_IS_CLK_DISABLED()     ((RCC->APBENR2 & (RCC_APBENR2_TIM16EN)) == RESET)
#define __HAL_RCC_TIM17_IS_CLK_ENABLED()      ((RCC->APBENR2 & (RCC_APBENR2_TIM17EN)) != RESET)
#define __HAL_RCC_TIM17_IS_CLK_DISABLED()     ((RCC->APBENR2 & (RCC_APBENR2_TIM17EN)) == RESET)
#define __HAL_RCC_ADC_IS_CLK_ENABLED()        ((RCC->APBENR2 & (RCC_APBENR2_ADCEN)) != RESET)
#define __HAL_RCC_ADC_IS_CLK_DISABLED()       ((RCC->APBENR2 & (RCC_APBENR2_ADCEN)) == RESET)
#define __HAL_RCC_COMP1_IS_CLK_ENABLED()      ((RCC->APBENR2 & (RCC_APBENR2_COMP1EN)) != RESET)
#define __HAL_RCC_COMP1_IS_CLK_DISABLED()     ((RCC->APBENR2 & (RCC_APBENR2_COMP1EN)) == RESET)
#define __HAL_RCC_COMP2_IS_CLK_ENABLED()      ((RCC->APBENR2 & (RCC_APBENR2_COMP2EN)) != RESET)
#define __HAL_RCC_COMP2_IS_CLK_DISABLED()     ((RCC->APBENR2 & (RCC_APBENR2_COMP2EN)) == RESET)
#define __HAL_RCC_LCD_IS_CLK_ENABLED()        ((RCC->APBENR2 & (RCC_APBENR2_LCDEN)) != RESET)
#define __HAL_RCC_LCD_IS_CLK_DISABLED()       ((RCC->APBENR2 & (RCC_APBENR2_LCDEN)) == RESET)
#if defined(TK)
#define __HAL_RCC_TK_IS_CLK_ENABLED()         ((RCC->APBENR2 & (RCC_APBENR2_TKEN)) != RESET)
#define __HAL_RCC_TK_IS_CLK_DISABLED()        ((RCC->APBENR2 & (RCC_APBENR2_TKEN)) == RESET)
#endif
#if defined(VREFBUF)
#define __HAL_RCC_VREFBUF_IS_CLK_ENABLED()    ((RCC->APBENR2 & (RCC_APBENR2_VREFBUFEN)) != RESET)
#define __HAL_RCC_VREFBUF_IS_CLK_DISABLED()   ((RCC->APBENR2 & (RCC_APBENR2_VREFBUFEN)) == RESET)
#endif

/**
  * @}
  */

