xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/03.controller_unit_sensor/system/libs/fwlib/py32l090_hal_rcc.h
/** @defgroup RCC_APB1_Force_Release_Reset APB1 Force Release Reset
  * @brief  Force or release APB1 peripheral reset.
  * @{
  */
#define __HAL_RCC_APB1_FORCE_RESET()         (RCC->APBRSTR1 = 0xFFFFFFFFU)
#define __HAL_RCC_TIM2_FORCE_RESET()         (RCC->APBRSTR1 |= (RCC_APBRSTR1_TIM2RST))
#define __HAL_RCC_TIM3_FORCE_RESET()         (RCC->APBRSTR1 |= (RCC_APBRSTR1_TIM3RST))
#define __HAL_RCC_TIM6_FORCE_RESET()         (RCC->APBRSTR1 |= (RCC_APBRSTR1_TIM6RST))
#define __HAL_RCC_TIM7_FORCE_RESET()         (RCC->APBRSTR1 |= (RCC_APBRSTR1_TIM7RST))
#define __HAL_RCC_PWM_FORCE_RESET()          (RCC->APBRSTR1 |= (RCC_APBRSTR1_PWMRST))
#define __HAL_RCC_WWDG_FORCE_RESET()         (RCC->APBRSTR1 |= (RCC_APBRSTR1_WWDGRST))
#define __HAL_RCC_SPI2_FORCE_RESET()         (RCC->APBRSTR1 |= (RCC_APBRSTR1_SPI2RST))
#define __HAL_RCC_LPUART2_FORCE_RESET()      (RCC->APBRSTR1 |= (RCC_APBRSTR1_LPUART2RST))
#define __HAL_RCC_USART2_FORCE_RESET()       (RCC->APBRSTR1 |= (RCC_APBRSTR1_USART2RST))
#define __HAL_RCC_UART1_FORCE_RESET()        (RCC->APBRSTR1 |= (RCC_APBRSTR1_UART1RST))
#define __HAL_RCC_UART2_FORCE_RESET()        (RCC->APBRSTR1 |= (RCC_APBRSTR1_UART2RST))
#define __HAL_RCC_LPUART1_FORCE_RESET()      (RCC->APBRSTR1 |= (RCC_APBRSTR1_LPUART1RST))
#define __HAL_RCC_I2C1_FORCE_RESET()         (RCC->APBRSTR1 |= (RCC_APBRSTR1_I2C1RST))
#define __HAL_RCC_I2C2_FORCE_RESET()         (RCC->APBRSTR1 |= (RCC_APBRSTR1_I2C2RST))
#define __HAL_RCC_OPA_FORCE_RESET()          (RCC->APBRSTR1 |= (RCC_APBRSTR1_OPARST))
#if defined(FDCAN)
#define __HAL_RCC_CAN_FORCE_RESET()          (RCC->APBRSTR1 |= (RCC_APBRSTR1_CANRST))
#endif
#define __HAL_RCC_DBG_FORCE_RESET()          (RCC->APBRSTR1 |= (RCC_APBRSTR1_DBGRST))
#define __HAL_RCC_PWR_FORCE_RESET()          (RCC->APBRSTR1 |= (RCC_APBRSTR1_PWRRST))
#define __HAL_RCC_DAC_FORCE_RESET()          (RCC->APBRSTR1 |= (RCC_APBRSTR1_DACRST))
#define __HAL_RCC_LPTIM2_FORCE_RESET()       (RCC->APBRSTR1 |= (RCC_APBRSTR1_LPTIM2RST))
#define __HAL_RCC_LPTIM1_FORCE_RESET()       (RCC->APBRSTR1 |= (RCC_APBRSTR1_LPTIM1RST))

#define __HAL_RCC_APB1_RELEASE_RESET()       (RCC->APBRSTR1 = 0x00)
#define __HAL_RCC_TIM2_RELEASE_RESET()       (RCC->APBRSTR1 &= ~ (RCC_APBRSTR1_TIM2RST))
#define __HAL_RCC_TIM3_RELEASE_RESET()       (RCC->APBRSTR1 &= ~ (RCC_APBRSTR1_TIM3RST))
#define __HAL_RCC_TIM6_RELEASE_RESET()       (RCC->APBRSTR1 &= ~ (RCC_APBRSTR1_TIM6RST))
#define __HAL_RCC_TIM7_RELEASE_RESET()       (RCC->APBRSTR1 &= ~ (RCC_APBRSTR1_TIM7RST))
#define __HAL_RCC_PWM_RELEASE_RESET()        (RCC->APBRSTR1 &= ~ (RCC_APBRSTR1_PWMRST))
#define __HAL_RCC_WWDG_RELEASE_RESET()       (RCC->APBRSTR1 &= ~ (RCC_APBRSTR1_WWDGRST))
#define __HAL_RCC_SPI2_RELEASE_RESET()       (RCC->APBRSTR1 &= ~ (RCC_APBRSTR1_SPI2RST))
#define __HAL_RCC_LPUART2_RELEASE_RESET()    (RCC->APBRSTR1 &= ~ (RCC_APBRSTR1_LPUART2RST))
#define __HAL_RCC_USART2_RELEASE_RESET()     (RCC->APBRSTR1 &= ~ (RCC_APBRSTR1_USART2RST))
#define __HAL_RCC_UART1_RELEASE_RESET()      (RCC->APBRSTR1 &= ~ (RCC_APBRSTR1_UART1RST))
#define __HAL_RCC_UART2_RELEASE_RESET()      (RCC->APBRSTR1 &= ~ (RCC_APBRSTR1_UART2RST))
#define __HAL_RCC_LPUART1_RELEASE_RESET()    (RCC->APBRSTR1 &= ~ (RCC_APBRSTR1_LPUART1RST))
#define __HAL_RCC_I2C1_RELEASE_RESET()       (RCC->APBRSTR1 &= ~ (RCC_APBRSTR1_I2C1RST))
#define __HAL_RCC_I2C2_RELEASE_RESET()       (RCC->APBRSTR1 &= ~ (RCC_APBRSTR1_I2C2RST))
#define __HAL_RCC_OPA_RELEASE_RESET()        (RCC->APBRSTR1 &= ~ (RCC_APBRSTR1_OPARST))
#if defined(FDCAN)
#define __HAL_RCC_CAN_RELEASE_RESET()        (RCC->APBRSTR1 &= ~ (RCC_APBRSTR1_CANRST))
#endif
#define __HAL_RCC_DBG_RELEASE_RESET()        (RCC->APBRSTR1 &= ~ (RCC_APBRSTR1_DBGRST))
#define __HAL_RCC_PWR_RELEASE_RESET()        (RCC->APBRSTR1 &= ~ (RCC_APBRSTR1_PWRRST))
#define __HAL_RCC_DAC_RELEASE_RESET()        (RCC->APBRSTR1 &= ~ (RCC_APBRSTR1_DACRST))
#define __HAL_RCC_LPTIM2_RELEASE_RESET()     (RCC->APBRSTR1 &= ~ (RCC_APBRSTR1_LPTIM2RST))
#define __HAL_RCC_LPTIM1_RELEASE_RESET()     (RCC->APBRSTR1 &= ~ (RCC_APBRSTR1_LPTIM1RST))

/**
  * @}
  */

/** @defgroup RCC_APB2_Force_Release_Reset APB2 Force Release Reset
  * @brief  Force or release APB2 peripheral reset.
  * @{
  */
#define __HAL_RCC_APB2_FORCE_RESET()         (RCC->APBRSTR2 = 0xFFFFFFFFU)
#define __HAL_RCC_SYSCFG_FORCE_RESET()       (RCC->APBRSTR2 |= (RCC_APBRSTR2_SYSCFGRST))
#define __HAL_RCC_TIM1_FORCE_RESET()         (RCC->APBRSTR2 |= (RCC_APBRSTR2_TIM1RST))
#define __HAL_RCC_SPI1_FORCE_RESET()         (RCC->APBRSTR2 |= (RCC_APBRSTR2_SPI1RST))
#define __HAL_RCC_USART1_FORCE_RESET()       (RCC->APBRSTR2 |= (RCC_APBRSTR2_USART1RST))
#define __HAL_RCC_TIM15_FORCE_RESET()        (RCC->APBRSTR2 |= (RCC_APBRSTR2_TIM15RST))
#define __HAL_RCC_TIM16_FORCE_RESET()        (RCC->APBRSTR2 |= (RCC_APBRSTR2_TIM16RST))
#define __HAL_RCC_TIM17_FORCE_RESET()        (RCC->APBRSTR2 |= (RCC_APBRSTR2_TIM17RST))
#define __HAL_RCC_ADC_FORCE_RESET()          (RCC->APBRSTR2 |= (RCC_APBRSTR2_ADCRST))
#define __HAL_RCC_COMP1_FORCE_RESET()        (RCC->APBRSTR2 |= (RCC_APBRSTR2_COMP1RST))
#define __HAL_RCC_COMP2_FORCE_RESET()        (RCC->APBRSTR2 |= (RCC_APBRSTR2_COMP2RST))
#define __HAL_RCC_LCD_FORCE_RESET()          (RCC->APBRSTR2 |= (RCC_APBRSTR2_LCDRST))
#if defined(TK)
#define __HAL_RCC_TK_FORCE_RESET()           (RCC->APBRSTR2 |= (RCC_APBRSTR2_TKRST))
#endif
#if defined(VREFBUF)
#define __HAL_RCC_VREFBUF_FORCE_RESET()      (RCC->APBRSTR2 |= (RCC_APBRSTR2_VREFBUFRST))
#endif

#define __HAL_RCC_APB2_RELEASE_RESET()       (RCC->APBRSTR2 = 0x00)
#define __HAL_RCC_SYSCFG_RELEASE_RESET()     (RCC->APBRSTR2 &= ~(RCC_APBRSTR2_SYSCFGRST))
#define __HAL_RCC_TIM1_RELEASE_RESET()       (RCC->APBRSTR2 &= ~(RCC_APBRSTR2_TIM1RST))
#define __HAL_RCC_SPI1_RELEASE_RESET()       (RCC->APBRSTR2 &= ~(RCC_APBRSTR2_SPI1RST))
#define __HAL_RCC_USART1_RELEASE_RESET()     (RCC->APBRSTR2 &= ~(RCC_APBRSTR2_USART1RST))
#define __HAL_RCC_TIM15_RELEASE_RESET()      (RCC->APBRSTR2 &= ~(RCC_APBRSTR2_TIM15RST))
#define __HAL_RCC_TIM16_RELEASE_RESET()      (RCC->APBRSTR2 &= ~(RCC_APBRSTR2_TIM16RST))
#define __HAL_RCC_TIM17_RELEASE_RESET()      (RCC->APBRSTR2 &= ~(RCC_APBRSTR2_TIM17RST))
#define __HAL_RCC_ADC_RELEASE_RESET()        (RCC->APBRSTR2 &= ~(RCC_APBRSTR2_ADCRST))
#define __HAL_RCC_COMP1_RELEASE_RESET()      (RCC->APBRSTR2 &= ~(RCC_APBRSTR2_COMP1RST))
#define __HAL_RCC_COMP2_RELEASE_RESET()      (RCC->APBRSTR2 &= ~(RCC_APBRSTR2_COMP2RST))
#define __HAL_RCC_LCD_RELEASE_RESET()        (RCC->APBRSTR2 &= ~(RCC_APBRSTR2_LCDRST))
#if defined(TK)
#define __HAL_RCC_TK_RELEASE_RESET()         (RCC->APBRSTR2 &= ~(RCC_APBRSTR2_TKRST))
#endif
#if defined(VREFBUF)
#define __HAL_RCC_VREFBUF_RELEASE_RESET()    (RCC->APBRSTR2 &= ~(RCC_APBRSTR2_VREFBUFRST))
#endif
/**
  * @}
  */

