xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/03.controller_unit_sensor/system/libs/fwlib/py32l090_hal_rcc.h
#define __HAL_RCC_AHB_FORCE_RESET()          (RCC->AHBRSTR = 0xFFFFFFFFU)
#define __HAL_RCC_DMA_FORCE_RESET()          (RCC->AHBRSTR |= (RCC_AHBRSTR_DMARST))
#define __HAL_RCC_CRC_FORCE_RESET()          (RCC->AHBRSTR |= (RCC_AHBRSTR_CRCRST))

#define __HAL_RCC_AHB_RELEASE_RESET()        (RCC->AHBRSTR = 0x00)
#define __HAL_RCC_DMA_RELEASE_RESET()        (RCC->AHBRSTR &= ~(RCC_AHBRSTR_DMARST))
#define __HAL_RCC_CRC_RELEASE_RESET()        (RCC->AHBRSTR &= ~(RCC_AHBRSTR_CRCRST))

/** @defgroup RCC_AHB2_Force_Release_Reset AHB2 Force Release Reset
  * @brief  Force or release APB2 peripheral reset.
  * @{
  */
#define __HAL_RCC_IOP_FORCE_RESET()         (RCC->IOPRSTR = 0xFFFFFFFFU)
#define __HAL_RCC_GPIOA_FORCE_RESET()       (RCC->IOPRSTR |= (RCC_IOPENR_GPIOAEN))
#define __HAL_RCC_GPIOB_FORCE_RESET()       (RCC->IOPRSTR |= (RCC_IOPENR_GPIOBEN))
#define __HAL_RCC_GPIOC_FORCE_RESET()       (RCC->IOPRSTR |= (RCC_IOPENR_GPIOCEN))
#define __HAL_RCC_GPIOD_FORCE_RESET()       (RCC->IOPRSTR |= (RCC_IOPENR_GPIODEN))

#define __HAL_RCC_IOP_RELEASE_RESET()       (RCC->IOPRSTR = 0x00)
#define __HAL_RCC_GPIOA_RELEASE_RESET()     (RCC->IOPRSTR &= ~(RCC_IOPENR_GPIOAEN))
#define __HAL_RCC_GPIOB_RELEASE_RESET()     (RCC->IOPRSTR &= ~(RCC_IOPENR_GPIOBEN))
#define __HAL_RCC_GPIOC_RELEASE_RESET()     (RCC->IOPRSTR &= ~(RCC_IOPENR_GPIOCEN))
#define __HAL_RCC_GPIOD_RELEASE_RESET()     (RCC->IOPRSTR &= ~(RCC_IOPENR_GPIODEN))

/**
  * @}
  */

/** @defgroup RCC_HSI_Configuration HSI Configuration
  * @{
  */

/** @brief  Macros to enable or disable the Internal High Speed oscillator (HSI).
  * @note   The HSI is stopped by hardware when entering STOP and STANDBY modes.
  * @note   HSI can not be stopped if it is used as system clock source. In this case,
  *         you have to select another source of the system clock then stop the HSI.
  * @note   After enabling the HSI, the application software should wait on HSIRDY
  *         flag to be set indicating that HSI clock is stable and can be used as
  *         system clock source.
  * @note   When the HSI is stopped, HSIRDY flag goes low after 6 HSI oscillator
  *         clock cycles.
  */
#define __HAL_RCC_HSI_ENABLE()  SET_BIT(RCC->CR, RCC_CR_HSION)
#define __HAL_RCC_HSI_DISABLE() CLEAR_BIT(RCC->CR, RCC_CR_HSION)

/** @brief  Macro to adjust the Internal High Speed oscillator (HSI) calibration value.
  * @note   The calibration is used to compensate for the variations in voltage
  *         and temperature that influence the frequency of the internal HSI RC.
  * @param  __HSICALIBRATIONVALUE__ specifies the calibration trimming value
  *          This parameter can be one of the following values:
  *            @arg @ref RCC_HSICALIBRATION_8MHz
  *            @arg @ref RCC_HSICALIBRATION_16MHz
  *            @arg @ref RCC_HSICALIBRATION_22p12MHz
  *            @arg @ref RCC_HSICALIBRATION_24MHz
  *            @arg @ref RCC_HSICALIBRATION_48MHz
  *            @arg @ref RCC_HSICALIBRATION_64MHz
  * @retval None
  */
#define __HAL_RCC_HSI_CALIBRATIONVALUE_ADJUST(__HSICALIBRATIONVALUE__) \
                                 MODIFY_REG(RCC->ICSCR, (RCC_ICSCR_HSI_FS_OPCR | RCC_ICSCR_HSI_TRIMCR), (uint32_t)(__HSICALIBRATIONVALUE__) << RCC_ICSCR_HSI_TRIMCR_Pos)

/** @brief  Macro to configure the HSISYS clock.
  * @param  __HSIDIV__ specifies the HSI division factor.
  *          This parameter can be one of the following values:
  *            @arg @ref RCC_HSI_DIV1   HSI clock source is divided by 1
  *            @arg @ref RCC_HSI_DIV2   HSI clock source is divided by 2
  *            @arg @ref RCC_HSI_DIV4   HSI clock source is divided by 4
  *            @arg @ref RCC_HSI_DIV8   HSI clock source is divided by 8
  *            @arg @ref RCC_HSI_DIV16  HSI clock source is divided by 16
  *            @arg @ref RCC_HSI_DIV32  HSI clock source is divided by 32
  *            @arg @ref RCC_HSI_DIV64  HSI clock source is divided by 64
  *            @arg @ref RCC_HSI_DIV128 HSI clock source is divided by 128
  */
#define __HAL_RCC_HSI_CONFIG(__HSIDIV__) \
                 MODIFY_REG(RCC->CR, RCC_CR_HSIDIV, (__HSIDIV__))

/**
  * @brief    Macros to enable or disable the force of the Internal High Speed oscillator (HSI)
  *           in STOP mode to be quickly available as kernel clock for I2Cs.
  * @note     Keeping the HSI ON in STOP mode allows to avoid slowing down the communication
  *           speed because of the HSI startup time.
  * @note     The enable of this function has not effect on the HSION bit.
  * @retval None
  */
#define __HAL_RCC_HSISTOP_ENABLE()     SET_BIT(RCC->CR, RCC_CR_HSIKERON)

#define __HAL_RCC_HSISTOP_DISABLE()    CLEAR_BIT(RCC->CR, RCC_CR_HSIKERON)
/**
  * @}
  */

/** @defgroup RCC_MSI_Configuration MSI Configuration
  * @{
  */
/** @brief  Macros to enable or disable the MSI.
  * @note   The MSI is stopped by hardware when entering STOP and STANDBY modes.
  * @note   MSI can not be stopped if it is used as system clock source. In this case,
  *         you have to select another source of the system clock then stop the MSI.
  * @note   After enabling the MSI, the application software should wait on MSIRDY
  *         flag to be set indicating that MSI clock is stable and can be used as
  *         system clock source.
  */
#define __HAL_RCC_MSI_ENABLE()  SET_BIT(RCC->CR, RCC_CR_MSION)
#define __HAL_RCC_MSI_DISABLE() CLEAR_BIT(RCC->CR, RCC_CR_MSION)
  
/** @brief  Macro to configure the MSISYS clock.
  * @param  __MSIDIV__ specifies the MSI division factor.
  *          This parameter can be one of the following values:
  *            @arg @ref RCC_MSI_DIV1   MSI clock source is divided by 1
  *            @arg @ref RCC_MSI_DIV2   MSI clock source is divided by 2
  *            @arg @ref RCC_MSI_DIV4   MSI clock source is divided by 4
  *            @arg @ref RCC_MSI_DIV8   MSI clock source is divided by 8
  *            @arg @ref RCC_MSI_DIV16  MSI clock source is divided by 16
  *            @arg @ref RCC_MSI_DIV32  MSI clock source is divided by 32
  *            @arg @ref RCC_MSI_DIV64  MSI clock source is divided by 64
  *            @arg @ref RCC_MSI_DIV128 MSI clock source is divided by 128
  */
#define __HAL_RCC_MSI_CONFIG(__MSIDIV__) \
                 MODIFY_REG(RCC->CR, RCC_CR_MSIDIV, (__MSIDIV__))
/**
  * @}
  */
  
