xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/03.controller_unit_sensor/system/libs/fwlib/py32l090_hal_rcc.h
/** @addtogroup RCC_Private_Constants
  * @{
  */

/** @defgroup RCC_Timeout RCC Timeout
  * @{
  */

/* Disable Backup domain write protection state change timeout */
#define RCC_DBP_TIMEOUT_VALUE          100U    /* 100 ms */
/* LSE state change timeout */
#if defined(RCC_LSE_SUPPORT)
#define RCC_LSE_TIMEOUT_VALUE          LSE_STARTUP_TIMEOUT
#endif
#define CLOCKSWITCH_TIMEOUT_VALUE      5000    /* 5 s    */
#if defined(RCC_HSE_SUPPORT)
#define HSE_TIMEOUT_VALUE              HSE_STARTUP_TIMEOUT
#endif
#define HSI_TIMEOUT_VALUE              2U      /* 2 ms (minimum Tick + 1) */
#define MSI_TIMEOUT_VALUE              2U      /* 2 ms (minimum Tick + 1) */
#define LSI_TIMEOUT_VALUE              2U      /* 2 ms (minimum Tick + 1) */
#define PLL_TIMEOUT_VALUE              2U      /* 2 ms (minimum Tick + 1) */
#define AHB_24MHZ                     (24000000U)
#define AHB_48MHZ                     (48000000U)
#define AHB_72MHZ                     (72000000U)
/**
  * @}
  */

/* Defines used for Flags */
#define CR_REG_INDEX                     ((uint8_t)1)
#define BDCR_REG_INDEX                   ((uint8_t)2)
#define CSR_REG_INDEX                    ((uint8_t)3)
#define CFGR_REG_INDEX                   ((uint8_t)4)

#define RCC_FLAG_MASK                    ((uint8_t)0x1F)

/**
  * @}
  */

/** @addtogroup RCC_Private_Macros
  * @{
  */
#if defined(RCC_HSE_SUPPORT)
#define IS_RCC_PLLSOURCE(__SOURCE__)                  (((__SOURCE__) == RCC_PLLSOURCE_HSI) || \
                                                       ((__SOURCE__) == RCC_PLLSOURCE_HSE))
#else
#define IS_RCC_PLLSOURCE(__SOURCE__)                  ((__SOURCE__) == RCC_PLLSOURCE_HSI)
#endif
#if defined(RCC_LSE_SUPPORT) && defined(RCC_HSE_SUPPORT)
#define IS_RCC_OSCILLATORTYPE(__OSCILLATOR__)         (((__OSCILLATOR__) == RCC_OSCILLATORTYPE_NONE)                           || \
                                                       (((__OSCILLATOR__) & RCC_OSCILLATORTYPE_HSE) == RCC_OSCILLATORTYPE_HSE) || \
                                                       (((__OSCILLATOR__) & RCC_OSCILLATORTYPE_HSI) == RCC_OSCILLATORTYPE_HSI) || \
                                                       (((__OSCILLATOR__) & RCC_OSCILLATORTYPE_LSI) == RCC_OSCILLATORTYPE_LSI) || \
                                                       (((__OSCILLATOR__) & RCC_OSCILLATORTYPE_LSE) == RCC_OSCILLATORTYPE_LSE) || \
                                                       (((__OSCILLATOR__) & RCC_OSCILLATORTYPE_MSI) == RCC_OSCILLATORTYPE_MSI))
#elif defined(RCC_HSE_SUPPORT) 
#define IS_RCC_OSCILLATORTYPE(__OSCILLATOR__)         (((__OSCILLATOR__) == RCC_OSCILLATORTYPE_NONE)                           || \
                                                       (((__OSCILLATOR__) & RCC_OSCILLATORTYPE_HSE) == RCC_OSCILLATORTYPE_HSE) || \
                                                       (((__OSCILLATOR__) & RCC_OSCILLATORTYPE_HSI) == RCC_OSCILLATORTYPE_HSI) || \
                                                       (((__OSCILLATOR__) & RCC_OSCILLATORTYPE_LSI) == RCC_OSCILLATORTYPE_LSI) || \
                                                       (((__OSCILLATOR__) & RCC_OSCILLATORTYPE_MSI) == RCC_OSCILLATORTYPE_MSI))
#elif defined(RCC_LSE_SUPPORT) 
#define IS_RCC_OSCILLATORTYPE(__OSCILLATOR__)         (((__OSCILLATOR__) == RCC_OSCILLATORTYPE_NONE)                           || \
                                                       (((__OSCILLATOR__) & RCC_OSCILLATORTYPE_HSI) == RCC_OSCILLATORTYPE_HSI) || \
                                                       (((__OSCILLATOR__) & RCC_OSCILLATORTYPE_LSI) == RCC_OSCILLATORTYPE_LSI) || \
                                                       (((__OSCILLATOR__) & RCC_OSCILLATORTYPE_LSE) == RCC_OSCILLATORTYPE_LSE) || \
                                                       (((__OSCILLATOR__) & RCC_OSCILLATORTYPE_MSI) == RCC_OSCILLATORTYPE_MSI))
#else
#define IS_RCC_OSCILLATORTYPE(__OSCILLATOR__)         (((__OSCILLATOR__) == RCC_OSCILLATORTYPE_NONE)                           || \
                                                       (((__OSCILLATOR__) & RCC_OSCILLATORTYPE_HSI) == RCC_OSCILLATORTYPE_HSI) || \
                                                       (((__OSCILLATOR__) & RCC_OSCILLATORTYPE_LSI) == RCC_OSCILLATORTYPE_LSI) || \
                                                       (((__OSCILLATOR__) & RCC_OSCILLATORTYPE_MSI) == RCC_OSCILLATORTYPE_MSI))
#endif
#if defined(RCC_HSE_SUPPORT)
#define IS_RCC_HSE(__HSE__)                           (((__HSE__) == RCC_HSE_OFF) || ((__HSE__) == RCC_HSE_ON) || \
                                                       ((__HSE__) == RCC_HSE_BYPASS))
#endif
#if defined(RCC_LSE_SUPPORT)
#define IS_RCC_LSE(__LSE__)                           (((__LSE__) == RCC_LSE_OFF) || ((__LSE__) == RCC_LSE_ON) || \
                                                       ((__LSE__) == RCC_LSE_BYPASS))
#endif
#define IS_RCC_HSI(__HSI__)                           (((__HSI__) == RCC_HSI_OFF) || ((__HSI__) == RCC_HSI_ON))

#define IS_RCC_HSI_CALIBRATION_VALUE(__VALUE__) (((__VALUE__) == RCC_HSICALIBRATION_8MHz)      || \
                                                 ((__VALUE__) == RCC_HSICALIBRATION_16MHz)     || \
                                                 ((__VALUE__) == RCC_HSICALIBRATION_22p12MHz)  || \
                                                 ((__VALUE__) == RCC_HSICALIBRATION_24MHz)     || \
                                                 ((__VALUE__) == RCC_HSICALIBRATION_48MHz)     || \
                                                 ((__VALUE__) == RCC_HSICALIBRATION_64MHz))

#define IS_RCC_HSIDIV(__DIV__)            (((__DIV__) == RCC_HSI_DIV1)  || ((__DIV__) == RCC_HSI_DIV2) || \
                                           ((__DIV__) == RCC_HSI_DIV4)  || ((__DIV__) == RCC_HSI_DIV8) || \
                                           ((__DIV__) == RCC_HSI_DIV16) || ((__DIV__) == RCC_HSI_DIV32)|| \
                                           ((__DIV__) == RCC_HSI_DIV64) || ((__DIV__) == RCC_HSI_DIV128))

#define IS_RCC_CALIBRATION_VALUE(__VALUE__)           ((__VALUE__) <= 0x1FU)

#define IS_RCC_MSI(__MSI__)                           (((__MSI__) == RCC_MSI_OFF) || ((__MSI__) == RCC_MSI_ON))

#define IS_RCC_MSIDIV(__DIV__)            (((__DIV__) == RCC_MSI_DIV1)  || ((__DIV__) == RCC_MSI_DIV2) || \
                                           ((__DIV__) == RCC_MSI_DIV4)  || ((__DIV__) == RCC_MSI_DIV8) || \
                                           ((__DIV__) == RCC_MSI_DIV16) || ((__DIV__) == RCC_MSI_DIV32)|| \
                                           ((__DIV__) == RCC_MSI_DIV64) || ((__DIV__) == RCC_MSI_DIV128))

#define IS_RCC_LSI(__LSI__)                           (((__LSI__) == RCC_LSI_OFF) || ((__LSI__) == RCC_LSI_ON))

#define IS_RCC_PLL(__PLL__)                           (((__PLL__) == RCC_PLL_NONE) || ((__PLL__) == RCC_PLL_OFF) || \
                                                        ((__PLL__) == RCC_PLL_ON))

#define IS_RCC_CLOCKTYPE(CLK)                         ((((CLK) & RCC_CLOCKTYPE_SYSCLK) == RCC_CLOCKTYPE_SYSCLK) || \
                                                       (((CLK) & RCC_CLOCKTYPE_HCLK)   == RCC_CLOCKTYPE_HCLK)   || \
                                                       (((CLK) & RCC_CLOCKTYPE_PCLK)  == RCC_CLOCKTYPE_PCLK))
#if defined(RCC_LSE_SUPPORT) && defined(RCC_HSE_SUPPORT)
#define IS_RCC_SYSCLKSOURCE(__SOURCE__)               (((__SOURCE__) == RCC_SYSCLKSOURCE_HSISYS) || \
                                                       ((__SOURCE__) == RCC_SYSCLKSOURCE_HSE)    || \
                                                       ((__SOURCE__) == RCC_SYSCLKSOURCE_PLLCLK) || \
                                                       ((__SOURCE__) == RCC_SYSCLKSOURCE_LSI)    || \
                                                       ((__SOURCE__) == RCC_SYSCLKSOURCE_LSE)    || \
                                                       ((__SOURCE__) == RCC_SYSCLKSOURCE_MSISYS))
#elif defined(RCC_HSE_SUPPORT) 
#define IS_RCC_SYSCLKSOURCE(__SOURCE__)               (((__SOURCE__) == RCC_SYSCLKSOURCE_HSISYS) || \
                                                       ((__SOURCE__) == RCC_SYSCLKSOURCE_HSE)    || \
                                                       ((__SOURCE__) == RCC_SYSCLKSOURCE_PLLCLK) || \
                                                       ((__SOURCE__) == RCC_SYSCLKSOURCE_LSI)    || \
                                                       ((__SOURCE__) == RCC_SYSCLKSOURCE_MSISYS))
#elif defined(RCC_LSE_SUPPORT) 
#define IS_RCC_SYSCLKSOURCE(__SOURCE__)               (((__SOURCE__) == RCC_SYSCLKSOURCE_HSISYS) || \
                                                       ((__SOURCE__) == RCC_SYSCLKSOURCE_PLLCLK) || \
                                                       ((__SOURCE__) == RCC_SYSCLKSOURCE_LSI)    || \
                                                       ((__SOURCE__) == RCC_SYSCLKSOURCE_LSE)    || \
                                                       ((__SOURCE__) == RCC_SYSCLKSOURCE_MSISYS))
#else
#define IS_RCC_SYSCLKSOURCE(__SOURCE__)               (((__SOURCE__) == RCC_SYSCLKSOURCE_HSISYS) || \
                                                       ((__SOURCE__) == RCC_SYSCLKSOURCE_PLLCLK) || \
                                                       ((__SOURCE__) == RCC_SYSCLKSOURCE_LSI)    || \
                                                       ((__SOURCE__) == RCC_SYSCLKSOURCE_MSISYS))
#endif
#if defined(RCC_LSE_SUPPORT) && defined(RCC_HSE_SUPPORT)
#define IS_RCC_SYSCLKSOURCE_STATUS(__SOURCE__)        (((__SOURCE__)  == RCC_SYSCLKSOURCE_STATUS_HSISYS) || \
                                                        ((__SOURCE__) == RCC_SYSCLKSOURCE_STATUS_HSE)    || \
                                                        ((__SOURCE__) == RCC_SYSCLKSOURCE_STATUS_PLLCLK) || \
                                                        ((__SOURCE__) == RCC_SYSCLKSOURCE_STATUS_LSI)    || \
                                                        ((__SOURCE__) == RCC_SYSCLKSOURCE_STATUS_LSE)    || \
                                                        ((__SOURCE__) == RCC_SYSCLKSOURCE_STATUS_MSISYS))
#elif defined(RCC_HSE_SUPPORT) 
#define IS_RCC_SYSCLKSOURCE_STATUS(__SOURCE__)        (((__SOURCE__)  == RCC_SYSCLKSOURCE_STATUS_HSISYS) || \
                                                        ((__SOURCE__) == RCC_SYSCLKSOURCE_STATUS_HSE)    || \
                                                        ((__SOURCE__) == RCC_SYSCLKSOURCE_STATUS_PLLCLK) || \
                                                        ((__SOURCE__) == RCC_SYSCLKSOURCE_STATUS_LSI)    || \
                                                        ((__SOURCE__) == RCC_SYSCLKSOURCE_STATUS_MSISYS))
#elif defined(RCC_LSE_SUPPORT) 
#define IS_RCC_SYSCLKSOURCE_STATUS(__SOURCE__)        (((__SOURCE__)  == RCC_SYSCLKSOURCE_STATUS_HSISYS) || \
                                                        ((__SOURCE__) == RCC_SYSCLKSOURCE_STATUS_PLLCLK) || \
                                                        ((__SOURCE__) == RCC_SYSCLKSOURCE_STATUS_LSI)    || \
                                                        ((__SOURCE__) == RCC_SYSCLKSOURCE_STATUS_LSE)    || \
                                                        ((__SOURCE__) == RCC_SYSCLKSOURCE_STATUS_MSISYS))
#else
#define IS_RCC_SYSCLKSOURCE_STATUS(__SOURCE__)        (((__SOURCE__)  == RCC_SYSCLKSOURCE_STATUS_HSISYS) || \
                                                        ((__SOURCE__) == RCC_SYSCLKSOURCE_STATUS_PLLCLK) || \
                                                        ((__SOURCE__) == RCC_SYSCLKSOURCE_STATUS_LSI)    || \
                                                        ((__SOURCE__) == RCC_SYSCLKSOURCE_STATUS_MSISYS))
#endif
#define IS_RCC_HCLK(__HCLK__)                         (((__HCLK__) == RCC_SYSCLK_DIV1) || ((__HCLK__) == RCC_SYSCLK_DIV2) || \
                                                       ((__HCLK__) == RCC_SYSCLK_DIV4) || ((__HCLK__) == RCC_SYSCLK_DIV8) || \
                                                       ((__HCLK__) == RCC_SYSCLK_DIV16) || ((__HCLK__) == RCC_SYSCLK_DIV64) || \
                                                       ((__HCLK__) == RCC_SYSCLK_DIV128) || ((__HCLK__) == RCC_SYSCLK_DIV256) || \
                                                       ((__HCLK__) == RCC_SYSCLK_DIV512))
                               
#define IS_RCC_PCLK(__PCLK__)                         (((__PCLK__) == RCC_HCLK_DIV1) || ((__PCLK__) == RCC_HCLK_DIV2) || \
                                                       ((__PCLK__) == RCC_HCLK_DIV4) || ((__PCLK__) == RCC_HCLK_DIV8) || \
                                                       ((__PCLK__) == RCC_HCLK_DIV16))
                               
#define IS_RCC_MCO(__MCO__)                           (((__MCO__) == RCC_MCO1) || ((__MCO__) == RCC_MCO2) || \
                                                       ((__MCO__) == RCC_MCO3) || ((__MCO__) == RCC_MCO4))

#define IS_RCC_MCODIV(__DIV__)                        (((__DIV__) == RCC_MCODIV_1) || ((__DIV__) == RCC_MCODIV_2) || \
                                                       ((__DIV__) == RCC_MCODIV_4) || ((__DIV__) == RCC_MCODIV_8) || \
                                                       ((__DIV__) == RCC_MCODIV_16) || ((__DIV__) == RCC_MCODIV_32) || \
                                                       ((__DIV__) == RCC_MCODIV_64) || ((__DIV__) == RCC_MCODIV_128) || \
                                                       ((__DIV__) == RCC_MCODIV_256))
#if defined(RCC_LSE_SUPPORT) && defined(RCC_HSE_SUPPORT)
#define IS_RCC_RTCCLKSOURCE(__SOURCE__)               (((__SOURCE__) == RCC_RTCCLKSOURCE_NONE) || \
                                                       ((__SOURCE__) == RCC_RTCCLKSOURCE_LSE) || \
                                                       ((__SOURCE__) == RCC_RTCCLKSOURCE_LSI) || \
                                                       ((__SOURCE__) == RCC_RTCCLKSOURCE_HSE_DIV32))
#elif defined(RCC_HSE_SUPPORT) 
#define IS_RCC_RTCCLKSOURCE(__SOURCE__)               (((__SOURCE__) == RCC_RTCCLKSOURCE_NONE) || \
                                                       ((__SOURCE__) == RCC_RTCCLKSOURCE_LSI) || \
                                                       ((__SOURCE__) == RCC_RTCCLKSOURCE_HSE_DIV32))
#elif defined(RCC_LSE_SUPPORT) 
#define IS_RCC_RTCCLKSOURCE(__SOURCE__)               (((__SOURCE__) == RCC_RTCCLKSOURCE_NONE) || \
                                                       ((__SOURCE__) == RCC_RTCCLKSOURCE_LSE) || \
                                                       ((__SOURCE__) == RCC_RTCCLKSOURCE_LSI))
#else
#define IS_RCC_RTCCLKSOURCE(__SOURCE__)               (((__SOURCE__) == RCC_RTCCLKSOURCE_NONE) || \
                                                       ((__SOURCE__) == RCC_RTCCLKSOURCE_LSI))
#endif
#if defined(RCC_LSE_SUPPORT)
#define IS_RCC_IWDGCLKSOURCE(__SOURCE__)               (((__SOURCE__) == RCC_IWDGCLKSOURCE_LSI) || \
                                                        ((__SOURCE__) == RCC_IWDGCLKSOURCE_LSE))
#else
#define IS_RCC_IWDGCLKSOURCE(__SOURCE__)               ((__SOURCE__) == RCC_IWDGCLKSOURCE_LSI)
#endif
#if defined(RCC_HSE_SUPPORT)
#define IS_RCC_HSE_FREQ(__DRIVER__)                   (((__DRIVER__) == RCC_HSE_4_8MHz)   || \
                                                       ((__DRIVER__) == RCC_HSE_8_16MHz)  || \
                                                       ((__DRIVER__) == RCC_HSE_16_24MHz) || \
                                                       ((__DRIVER__) == RCC_HSE_24_32MHz))
#endif
#if defined(RCC_LSE_SUPPORT)
#define IS_RCC_LSE_DRIVER(__DRIVER__)                 (((__DRIVER__) == RCC_LSEDRIVE_LOW)    || \
                                                       ((__DRIVER__) == RCC_LSEDRIVE_MEDIUM) || \
                                                       ((__DRIVER__) == RCC_LSEDRIVE_HIGH)   || \
                                                       ((__DRIVER__) == RCC_LSEDRIVE_VERY_HIGH ))
#endif
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __PY32L090_HAL_RCC_H */

/************************ (C) COPYRIGHT Puya *****END OF FILE******************/
